       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY 'IBMUSER - TEST PROGRAM'.
           DISPLAY 'from IDz of Viji''s desktop - TEST PROGRAM'.
           DISPLAY 'Test Pusg Viji''s desktop - TEST PROGRAM'.
           STOP RUN.