//ADCDMSTJ  JOB MSGLEVEL=(1,1),NOTIFY=&SYSUID,REGION=0M
//*
//STEP010  EXEC PGM=IEFBR14
//DD1      DD DSN=ADCDMST.SAMPLE.PS1,
//            DISP=(NEW,CATLG,DELETE),UNIT=SYSDA,
//            SPACE=(TRK,(2,2),RLSE),
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=800)
/*
//
